Source files/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Source files/CommonModules/КурсыВалют/Ext/Module.bsl
Процедура ОбновитьКурсыВалют() Экспорт
	Адрес =  "www.cbr-xml-daily.ru";
	ЗС = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(Адрес,,,,,,ЗС,);
	Заголовки = Новый Соответствие;
	HTTPЗапрос = Новый HTTPЗапрос("/daily_json.js",Заголовки);
	Результат = HTTPСоединение.Получить(HTTPЗапрос,"");
	Ответ = Результат.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ);
	Курсы = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Для Каждого Курс Из Курсы.Valute Цикл
		Валюта = Справочники.Валюты.НайтиПоНаименованию(Курс.Ключ);
		Если Валюта <> Справочники.Валюты.ПустаяСсылка() Тогда
			МенеджерЗаписи = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Валюта = Валюта;
			МенеджерЗаписи.Курс = Курс.Значение.Value;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
